|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

# Read data and describe it

In [1]:
import pandas as pd
import numpy as np
import os
os.chdir(r"C:\Users\Samarpit\Desktop\LEARBAY\weekday2019_09_05")
titanic_data = pd.read_csv("titanic_dataset.csv")
rawdata =titanic_data
titanic_data.head(5)
titanic_data.describe() # for int data type
titanic_data.describe(include = [np.float]) # for float data type
titanic_data.describe(include = [np.object]) # for string/object data type

,name,gender,ticket,fare,cabin,embarked,boat,home.dest
count,1309,1309,1309,1308,295,1307,486,745
unique,1307,2,929,263,186,3,27,369
top,"Kelly, Mr. James",male,CA. 2343,$8.05,C23 C25 C27,S,13,"New York, NY"
freq,2,843,11,60,6,914,39,64

# Find columns with missingdata

In [2]:
titanic_data.columns[titanic_data.isnull().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

# Print shape of dataset

In [3]:
titanic_data.shape

(1309, 15)

# drop columns with more than 25% missing data

In [4]:
misscheck = (titanic_data.isna().sum()/titanic_data.shape[0])*100
misscheck = pd.DataFrame(misscheck)
misscheck= misscheck[misscheck[0]>25]
misscheck

                   0
cabin      77.463713
boat       62.872422
body       90.756303
home.dest  43.086325

In [5]:
d=misscheck.index
titanic_data =titanic_data.drop(d, axis=1)
titanic_data.head()
titanic_data.columns

Index(['Unnamed: 0', 'pclass', 'survived', 'name', 'gender', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'embarked'],
      dtype='object')

# drop columns having independent values(which do not affect the survival rate).

In [12]:
# titanic_data.columns
# titanic_data.head(2)
# doubt

# check data types of all columns

In [7]:
rawdata.dtypes
# or
rawdata.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
Unnamed: 0    1309 non-null int64
pclass        1309 non-null int64
survived      1309 non-null int64
name          1309 non-null object
gender        1309 non-null object
age           1046 non-null float64
sibsp         1309 non-null int64
parch         1309 non-null int64
ticket        1309 non-null object
fare          1308 non-null object
cabin         295 non-null object
embarked      1307 non-null object
boat          486 non-null object
body          121 non-null float64
home.dest     745 non-null object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB

# convert price to numeric

- DataFrame.fillna : Fill NA values
- DataFrame.where : Replace values based on boolean condition
- Series.str.replace : Simple string replacement.

In [8]:
titanic_data['fare'] =titanic_data['fare'].replace('\$','',regex=True) # read about replace again (shift+tab (indepth))
titanic_data['fare']
titanic_data.head()
titanic_data['fare'] = titanic_data['fare'].astype('float')
print(titanic_data['fare'].dtype)
titanic_data.head(2)

float64

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.34,S
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,S

# find columns still having missing/na values and also count of missing data

In [9]:
missing= pd.DataFrame(titanic_data.isna().sum())
missing =missing[missing[0]>0]
missing

            0
age       263
fare        1
embarked    2

# fill na with mean for fare and age column column.

In [10]:
titanic_data.age =titanic_data.age.fillna(np.mean(titanic_data.age))
titanic_data.fare =titanic_data.age.fillna(np.mean(titanic_data.fare))
print(titanic_data.shape)
titanic_data.isna().sum()

(1309, 11)

Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
fare          0
embarked      2
dtype: int64

# drop na values for embarked column.

In [11]:
titanic_data=titanic_data.dropna()
print(titanic_data.shape)

(1307, 11)

# dump the dataframe to a csv file 'titanic_filtered.csv'.

In [14]:
titanic_data.to_csv(r'C:\Users\Samarpit\Desktop\LEARBAY\weekday2019_09_05\dump_titanic.csv')

# for survived column replace 0 with D and 1 with A

In [19]:
titanic_data.survived=titanic_data.survived.replace(0,"D")
titanic_data.survived=titanic_data.survived.replace(1,"A")
titanic_data.head()

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
0,0,1,A,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,29.0000,S
1,1,1,A,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,0.9167,S
2,2,1,D,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,2.0000,S
3,3,1,D,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,30.0000,S
4,4,1,D,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,25.0000,S

# find the frequency of different values in survived column

In [23]:
titanic_data.survived.value_counts()

D    809
A    498
Name: survived, dtype: int64

# group by gender and survived and see the counts in each category

In [24]:
titanic_data.groupby(['gender','survived']).count()

                 Unnamed: 0  pclass  name  age  sibsp  parch  ticket  fare  \
gender survived
female A                337     337   337  337    337    337     337   337
       D                127     127   127  127    127    127     127   127
male   A                161     161   161  161    161    161     161   161
       D                682     682   682  682    682    682     682   682

                 embarked
gender survived
female A              337
       D              127
male   A              161
       D              682

# find different pclass and no of people in each class

In [32]:
print(titanic_data.pclass.unique())
print()
titanic_data.pclass.value_counts()

[1 2 3]

3    709
1    321
2    277
Name: pclass, dtype: int64

# find top 5 people with highest values of age. Count no of male and females in the top 5

In [90]:
# titanic_data.head().sort_values(by=titanic_data.age,ascending=False)
# titanic_data.duplicated('age').sum()
top5 =titanic_data.nlargest(5, 'age', keep='first')
print(top5.gender.value_counts())
top5

male      4
female    1
Name: gender, dtype: int64

,Unnamed: 0,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked
14,14,1,A,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,80.0,S
61,61,1,A,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,76.0,S
1235,1235,3,D,"Svensson, Mr. Johan",male,74.0,0,0,347060,74.0,S
9,9,1,D,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,71.0,C
135,135,1,D,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,71.0,C

# find max age male and female who survived

In [65]:
pd.pivot_table(titanic_data,index=["survived"],values=["age"],aggfunc=np.max)

           age
survived
A         80.0
D         74.0

# get average age by gender

In [68]:
pd.pivot_table(titanic_data,index=["gender"],values=["age"],aggfunc=np.average)

              age
gender
female  28.795931
male    30.430716

# get average age by people survived vs not-survived

In [64]:
pd.pivot_table(titanic_data,index=["survived"],values=["age"],aggfunc=np.average)

                age
survived
A         28.974711
D         30.389368